Revit 2026 API

# ViewScheduleSplitSegment Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SplitSegment(
	int segmentIndex,
	IList<double> segmentHeights
)
```
```vb
Public Sub SplitSegment (
	segmentIndex As Integer,
	segmentHeights As IList(Of Double)
)
```
```cpp
public:
void SplitSegment(
	int segmentIndex,
	IList<double>^ segmentHeights
)
```
```fsharp
member SplitSegment :
        segmentIndex : int *
        segmentHeights : IList<float> -> unit
```

#### Parameters

segmentIndex Int32

segmentHeights IListDouble

#### Reference

ViewSchedule Class

Autodesk.Revit.DB Namespace